## 1.5 Manipulating Data

In [1]:
import pandas as pd

%matplotlib inline
import matplotlib.pyplot as plt

car_sales = pd.read_csv('car-sales.csv')

car_sales["Price"] = car_sales["Price"].str.replace('[\$\,]', '').astype(float)

<ipython-input-1-5a25cbdb907d>:8: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales["Price"] = car_sales["Price"].str.replace('[\$\,]', '').astype(float)

**String Methods**

In [2]:
#Anything you can do to strings in python, you can do to columns in pandas
car_sales['Make'].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [3]:
#This wont save the changes to the original dataframe
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [4]:
#Pandas requires that you re-assign a column if you want to change the data type.
#The following code will reassign the car_sales make column to be a lowercase string
car_sales['Make'] = car_sales['Make'].str.lower()
car_sales

#Later we will look at another method for reasigning columns using the inplace parameter.

     Make Colour  Odometer (KM)  Doors    Price
0  toyota  White         150043      4   4000.0
1   honda    Red          87899      4   5000.0
2  toyota   Blue          32549      3   7000.0
3     bmw  Black          11179      5  22000.0
4  nissan  White         213095      4   3500.0
5  toyota  Green          99213      4   4500.0
6   honda   Blue          45698      4   7500.0
7   honda   Blue          54738      4   7000.0
8  toyota  White          60000      4   6250.0
9  nissan  White          31600      4   9700.0

**Missing Data**

In [5]:
#Real data stets often have a lot of missing values.
#Missing values are represented by NaN.
car_sales_missing = pd.read_csv('car-sales-missing-data.csv')
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [6]:
#We can use fillna to fill in missing values.
#For example, if we want to fill in missing values with the mean of the column, we can use the following code:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [7]:
 car_sales_missing['Odometer'].mean()

92302.66666666667

In [8]:
#When we look at our dataframe again, we can see that the missing values have not been filled in.
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [9]:
#There are many ways to fill in missing values.

#We can reassign the column.
# car_sales_missing['Odometer'] = car_sales_missing['Odometer'].fillna(car_sales_missing['Odometer'].mean())
# car_sales_missing

#We can also use the inplace parameter to fill in missing values.
    #When inplace = True , the data is modified in place, which means it will return nothing and the dataframe is now updated. 
    #When inplace = False , which is the default, then the operation is performed and it returns a copy of the object.
car_sales_missing['Odometer'].fillna(car_sales_missing['Odometer'].mean(), inplace=True)
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [10]:
#To remove missing values, we can use the dropna method.
# car_sales_missing.dropna()

#However, this will not work when we reference the dataframe.
# car_sales_missing

#To change this we can set the inplace parameter to True.
car_sales_missing.dropna(inplace=True)
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [11]:
#The downfall of setting the inplace parameter to true is that we have to import it again if we want to reset the dataframe.
car_sales_missing = pd.read_csv('car-sales-missing-data.csv')
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [12]:
 #We can create a new dataframe with only the rows that have missing values.
 car_sales_missing_dropped = car_sales_missing.dropna()
 car_sales_missing_dropped

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [13]:
#We can access the rows that have missing values by exporting the modified dataframe to a new csv file.
car_sales_missing_dropped.to_csv('car-sales-missing-data-dropped.csv')

**Creating Data from Existing Data**

In [14]:
#Column from series

#Step 1: Create a series called seats_column
seats_column = pd.Series([5, 5, 5, 5, 5])

#Step 2: Make a new column called seats and set it equal to the series we created.
car_sales['Seats'] = seats_column
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   4000.0    5.0
1   honda    Red          87899      4   5000.0    5.0
2  toyota   Blue          32549      3   7000.0    5.0
3     bmw  Black          11179      5  22000.0    5.0
4  nissan  White         213095      4   3500.0    5.0
5  toyota  Green          99213      4   4500.0    NaN
6   honda   Blue          45698      4   7500.0    NaN
7   honda   Blue          54738      4   7000.0    NaN
8  toyota  White          60000      4   6250.0    NaN
9  nissan  White          31600      4   9700.0    NaN

In [16]:
#We can fill in missing values using the fillna method.
car_sales['Seats'].fillna(5, inplace=True)
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   4000.0    5.0
1   honda    Red          87899      4   5000.0    5.0
2  toyota   Blue          32549      3   7000.0    5.0
3     bmw  Black          11179      5  22000.0    5.0
4  nissan  White         213095      4   3500.0    5.0
5  toyota  Green          99213      4   4500.0    5.0
6   honda   Blue          45698      4   7500.0    5.0
7   honda   Blue          54738      4   7000.0    5.0
8  toyota  White          60000      4   6250.0    5.0
9  nissan  White          31600      4   9700.0    5.0

In [19]:
#Column from Python list
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 4.7, 7.6, 8.7, 3.0, 4.5]
car_sales['Fuel per 100KM'] = fuel_economy
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats  Fuel per 100KM
0  toyota  White         150043      4   4000.0    5.0             7.5
1   honda    Red          87899      4   5000.0    5.0             9.2
2  toyota   Blue          32549      3   7000.0    5.0             5.0
3     bmw  Black          11179      5  22000.0    5.0             9.6
4  nissan  White         213095      4   3500.0    5.0             8.7
5  toyota  Green          99213      4   4500.0    5.0             4.7
6   honda   Blue          45698      4   7500.0    5.0             7.6
7   honda   Blue          54738      4   7000.0    5.0             8.7
8  toyota  White          60000      4   6250.0    5.0             3.0
9  nissan  White          31600      4   9700.0    5.0             4.5

In [21]:
#Example: Create a column to represent the total amount of fuel consumed by the car over its lifetime.

car_sales['Total fuel used (L)'] = car_sales['Odometer (KM)']/100 * car_sales['Fuel per 100KM']
car_sales

#First, this is going to create a new column called Total fuel used.
#Then its going to take the odometer column and divide it by 100, then multiply it by the fuel per 100KM column.
#For example the calculation for the first row is (150043 KM)*(7.5L/100KM) = 1125.225L

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L)
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000

In [22]:
#Create a column from a single value
car_sales['Number of wheels'] = 4
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L),Number of wheels
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,4
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,4
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,4
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,4
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,4
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,4
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,4
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4

In [23]:
#There are different column types in pandas.
car_sales['Passed road saftey'] = True
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used (L),Number of wheels,Passed road saftey
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,4,True
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,4,True
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,4,True
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,4,True
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,4,True
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4,True
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,4,True
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4,True
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,4,True
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4,True

In [24]:
car_sales.dtypes

Make                    object
Colour                  object
Odometer (KM)            int64
Doors                    int64
Price                  float64
Seats                  float64
Fuel per 100KM         float64
Total fuel used (L)    float64
Number of wheels         int64
Passed road saftey        bool
dtype: object